export const navLinks = [
    { id: 1, href: '/about', title: 'Про нас' },
    {
        id: 2, href: '/instructors', title: 'Інструктори', drop: [
            { href: '/instructors/ava-miler', title: 'Ава Милер' },
            { href: '/instructors/ivan-smile', title: 'Іван Смайл' },
            { href: '/instructors/sofia-mitchel', title: 'Софія Мітчел' },
            { href: '/instructors/maxim-smith', title: 'Максим Сміт' },
            { href: '/instructors/tatyana-yuhno', title: 'Тетяна Юхно' },
        ]
    },
    {
        id: 3, href: '/classes', title: 'Класи', drop: [
            { href: '/classes/ashtanga-yoga', title: 'Аштанга йога' },
            { href: '/classes/bikram-yoga', title: 'Бікрам йога' },
            { href: '/classes/kundalIni-yoga', title: 'Кундаліні йога' },
            { href: '/classes/hatha-yoga', title: 'Хатха йога' },
            { href: '/classes/fly-yoga', title: 'Флай йога' },
        ]
    },
    { id: 4, href: '/gallery', title: 'Галерея' },
    { id: 5, href: '/blog/all', title: 'Блог' },
]

export const sliderDataHome = [
    { image: '/slider/slider-1.jpg', title: 'Злови свій потік енергії у Студії Йоги Віньяса', desc: "Динамічні зв'язки віньяси для сили, гнучкості та відмінного настрою на весь день.", href: '' },
    { image: '/slider/slider-2.jpg', title: 'Гармонія у кожному русі', desc: 'Синхронізуйте дихання та асани на заняттях віньяса-йогою, щоб отримати внутрішній спокій.', href: '' },
    { image: '/slider/slider-3.jpg', title: 'Вдих. Рух. Перезавантаження.', desc: "Залишіть метушню за дверима студії - м'який і плавний потік віньяси допоможе зняти напругу.", href: '' },
]

// Картинка формируется /classes/[slug].jpg
// Например /classes/ashtanga-yoga.jpg

export const classesData = [
    { slug: 'ashtanga-yoga', title: 'Аштанга йога', image: '/classes/ashtanga-yoga.jpg', desc: 'Аштанга-йога - давня система йоги, яка включає фізичні практики, роботу з диханням і медитацію. Цей стиль йоги був розроблений Шрі К. Паттабхі Джойсом в Індії в середині 20 століття і швидко завоював популярність у всьому світі. Аштанга-йога дотримується суворої структури та послідовності поз, що виконуються в певному порядку. Фундаментальні принципи цієї практики включають синхронізацію рухів із диханням, створення потоку енергії та допомогу у детоксикації організму. Практикуючі аштанга-йогу поділяють на серії, кожна з яких складається з певного набору асан (йогічних поз). Серія починається з більш простих поз і поступово стає все складнішою, що дозволяє практикуючим з часом розвиватися та поглиблювати свою практику.' },
    { slug: 'kundalIni-yoga', title: 'Кундаліні йога', image: '/classes/kundalIni-yoga.jpg', desc: 'Кундаліні-йога - це давня і потужна практика, спрямована на пробудження внутрішньої енергії, яка, згідно з філософією вчення, дрімає в основі хребта. На відміну від більш статичних напрямків, ця система поєднує динамічні фізичні вправи, дихальні техніки, медитації і спів мантр. Її головна мета полягає в тому, щоб підняти цю життєву силу вгору через основні енергетичні центри, очищуючи і гармонізуючи тіло і розум. Кожне заняття кундаліні-йогою є чітко вивіреною послідовністю дій, яка називається крийей. Особлива увага тут приділяється пранаямі – управлінню диханням, яке допомагає швидко змінити внутрішній стан, зняти ментальну напругу та наситити організм киснем. Практикуючі часто відзначають, що вплив відбувається на глибокому гормональному та неврологічному рівнях, що дозволяє за короткий час відчути приплив сил, ясність думок та емоційну стабільність.' },
    { slug: 'hatha-yoga', title: 'Хатха йога', image: '/classes/hatha-yoga.jpg', desc: "Хатха-йога - це стародавнє мистецтво досягнення внутрішньої гармонії, яке поєднує фізичну силу та ментальний спокій. Сама назва практики складається з двох складів: 'ха' символізує активну сонячну енергію, а 'тха' - м'яку місячну. Основна мета цього напряму полягає в тому, щоб збалансувати ці протилежні початки всередині людини, допомагаючи йому набути стійкості та внутрішнього спокою серед повсякденного хаосу. Основою практики є асани (статичні пози) та пранаями (дихальні вправи). Виконуючи асани, людина вчиться краще відчувати своє тіло, зміцнює м'язи, розвиває гнучкість і знімає фізичні затиски, що накопичилися. Усвідомлене дихання під час занять допомагає зосередитися на поточному моменті, м'яко перезавантажує нервову систему та звільняє розум від нав'язливих думок та тривог." },
    { slug: 'bikram-yoga', title: 'Бікрам йога', image: '/classes/bikram-yoga.jpg', desc: "Бікрам-йога, також відома як «гаряча йога», є унікальною практикою, яка проходить у спеціально підготовленому класі з температурою близько 40 °C і вологістю 40%. Цей метод включає суворо фіксовану послідовність з 26 асан хатха-йоги та двох дихальних вправ. Висока температура в залі імітує тропічний клімат Індії, що допомагає швидше розігріти м'язи, зробити зв'язки еластичнішими і значно знизити ризик отримання травм під час виконання глибоких розтяжок. Основою практики є асани (статичні пози) та пранаями (дихальні вправи). Виконуючи асани, людина вчиться краще відчувати своє тіло, зміцнює м'язи, розвиває гнучкість і знімає фізичні затиски, що накопичилися. Усвідомлене дихання під час занять допомагає зосередитися на поточному моменті, м'яко перезавантажує нервову систему та звільняє розум від нав'язливих думок та тривог." },
    { slug: 'fly-yoga', title: 'Флай йога', image: '/classes/fly-yoga.jpg', desc: "Флай-йога, або йога в гамаках, - це дивовижний напрямок, який переносить звичну практику в повітряний простір і дарує неповторне відчуття невагомості. Головним інструментом тут є спеціальний міцний полотно-гамак, надійно закріплений під стелею. Він м'яко підтримує тіло, дозволяючи виконувати асани, які на килимку можуть здаватися надто складними чи недоступними. Перевертаючись вниз головою або плавно погойдуючись у повітрі, людина звільняє розум від повсякденних турбот і відкриває нові грані можливостей свого тіла. З фізичного погляду флай-йога приносить колосальну користь всьому організму, і в першу чергу - хребту. Завдяки силі гравітації та підтримці гамака відбувається м'яке витягнення спини, знімається затисненість у міжхребцевих дисках та покращується постава. Регулярні тренування відмінно зміцнюють м'язовий корсет, залучаючи навіть глибокі м'язи-стабілізатори, розвивають гнучкість та покращують координацію рухів. Перевернуті положення стимулюють кровообіг і насичують мозок киснем, що дарує потужний заряд енергії." },
]

// Картинка формируется /instructors/[slug].jpg
// Например /instructors/ava-miler.jpg

export const instructorsData = [
    {
        name: 'Ава Милер', direction: 'Хатха йога', slug: 'ava-miler', contacts: {
            tel: '+38 066 196-56-44', email: 'avamiler@gmail.com', socials: ['tel', 'inst', 'twit']
        }
    },
    {
        name: 'Іван Смайл', direction: 'Аштанга йога', slug: 'ivan-smile', contacts: {
            tel: '+38 066 196-56-44', email: 'avamiler@gmail.com', socials: ['tel', 'inst', 'twit']
        }
    },
    {
        name: 'София Митчел', direction: 'Кундалини йога', slug: 'sofia-mitchel', contacts: {
            tel: '+38 066 196-56-44', email: 'avamiler@gmail.com', socials: ['tel', 'inst', 'twit']
        }
    },
    {
        name: 'Максим Смит', direction: 'Бикрам йога', slug: 'maxim-smith', contacts: {
            tel: '+38 066 196-56-44', email: 'avamiler@gmail.com', socials: ['tel', 'inst', 'twit']
        }
    },
    {
        name: 'Тетяна Юхно', direction: 'Флай йога', slug: 'tatyana-yuhno', contacts: {
            tel: '+38 066 196-56-44', email: 'avamiler@gmail.com', socials: ['tel', 'inst', 'twit']
        }
    },
]

export const faqList = [
    { id: 1, title: 'Чи можу я прийти на заняття увечері?', desc: 'Так, ви можете прийти на заняття увечері. Вечорами ми пропонуємо заняття хатха-йогою, аштанга-йогою та медитацією. Приходьте, ми будемо раді бачити вас.' },
    { id: 2, title: 'Як вибрати відповідний клас для свого рівня підготовки?', desc: 'Так, ви можете прийти на заняття увечері. Вечорами ми пропонуємо заняття хатха-йогою, аштанга-йогою та медитацією. Приходьте, ми будемо раді бачити вас.' },
    { id: 3, title: 'Що потрібно одягнути на заняття йогою?', desc: 'Так, ви можете прийти на заняття увечері. Вечорами ми пропонуємо заняття хатха-йогою, аштанга-йогою та медитацією. Приходьте, ми будемо раді бачити вас.' },
    { id: 4, title: 'Як довго видно результати від практики йоги?', desc: 'Так, ви можете прийти на заняття увечері. Вечорами ми пропонуємо заняття хатха-йогою, аштанга-йогою та медитацією. Приходьте, ми будемо раді бачити вас.' },
    { id: 5, title: 'Чи можу я займатися йогою, якщо у мене є травми чи обмеження?', desc: 'Так, ви можете прийти на заняття увечері. Вечорами ми пропонуємо заняття хатха-йогою, аштанга-йогою та медитацією. Приходьте, ми будемо раді бачити вас.' },
    { id: 6, title: 'Які переваги приносить медитація у рамках занять йогою?', desc: 'Так, ви можете прийти на заняття увечері. Вечорами ми пропонуємо заняття хатха-йогою, аштанга-йогою та медитацією. Приходьте, ми будемо раді бачити вас.' },

]

export const reviewsData = [
    { image: '/review-1.jpg', name: 'Олексій Іванов', desc: 'Я вперше спробував йогу в студії Віньяса і був вражений теплим прийомом і турботою. Заняття не тільки ефективні, а й приносять задоволення. Рекомендую всім, хто шукає гармонію та силу.' },
    { image: '/review-2.jpg', name: 'Еліза Коллінз', desc: 'Зачарована професіоналізмом інструкторів та гарним дизайном студії. Я знайшла тут не тільки чудові уроки, а й підтримку свого особистого шляху йоги. Дякую, Віньяса' },
    { image: '/review-3.jpg', name: 'Ганна Миронова', desc: 'Дуже вдячна студії "Віньяса" за надихаючі заняття та турботу про кожного учня. Тут я навчилася чути своє тіло і знайшла шлях до внутрішньої рівноваги. Рекомендую всім, хто шукає реальну трансформацію.' },
    { image: '/review-4.jpg', name: 'Ліам Івановський', desc: 'Практика йоги в студії Віньяса стала для мене справжнім відкриттям. Кожне заняття – це можливість відключитися від повсякденної метушні та набути гармонії.' },
]

export const blogData = [
    { title: 'Магія в русі: що таке Віньяса-йога?', content: 'Якщо ви шукаєте практику, де немає місця нудьги та монотонності, ласкаво просимо на Віньяса-флоу! Це динамічний напрям йоги, в якому асани плавно перетікають одна в одну, нагадуючи усвідомлений танець. Тут немає затяжних статичних пауз – кожен рух народжується на вдиху та завершується на видиху. Віньяса ідеально підходить тим, хто хоче одночасно зміцнити тіло, розвинути гнучкість та повністю «відключити» метушливі думки за рахунок високої концентрації на моменті «тут і зараз».', category: 'fitness', date: '02/05/26', src: '/blog/blog-1.jpg' },
    { title: 'Сполучна нитка: як дихання керує вашим тілом у Віньясі', content: 'У Віньяса-йозі дихання – це не просто фізіологічний процес, це головний режисер вашої практики. Ми використовуємо спеціальну техніку Уджайї («дихання океану»), яка допомагає зігріти тіло зсередини, утримувати баланс у складних позах та контролювати рівень енергії. По суті, рух слідує за вашим диханням, а не навпаки. Коли ви вчитеся синхронізувати кожен крок на килимку з плавним вдихом або видихом, практика перетворюється на динамічну медитацію, а розум миттєво заспокоюється.', category: 'asanyi', date: '12/06/26', src: '/blog/blog-2.jpg' },
    { title: 'Заголовок: «Я не вмію складатися навпіл»: 3 міфи про Віньяса-йогу', content: 'Багато хто думає, що динамічна йога створена виключно для гнучких людей із соцмереж, але це величезна помилка. По-перше, Віньяса неймовірно адаптивна: для будь-якої складної пози завжди є спрощена модифікація. По-друге, вам не потрібно бути гуру концентрації - сам темп практики не дозволить вам думати про робочі дедлайни або домашні справи. Приходьте на килимок з будь-яким рівнем підготовки: регулярні заняття самі збудують вашу силу, баланс та гнучкість з нуля.', category: 'vinyasa', date: '28/06/26', src: '/blog/blog-3.jpg' },
    { title: 'Перезавантаження за 60 хвилин: що дає тілу регулярний Flow', content: "Чому після класу Віньяси відчуваєш себе втомленим і неймовірно зарядженим? Вся справа у комплексному впливі на організм. Динамічні переходи чудово зміцнюють м'язовий корсет, покращують поставу та м'яко витягують хребет. У той же час безперервний потік рухів стимулює лімфострум і метаболізм, допомагаючи тілу позбавлятися токсинів. Але головний бонус – це ментальна легкість: ви виходите із зали з абсолютно чистою головою, готові до будь-яких життєвих завдань.", category: 'vinyasa', date: '03/07/26', src: '/blog/blog-4.jpg' }
]